Revit 2024 API
XYZ.Z Property
Gets the third coordinate.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double Z { get; }
Visual Basic
Public ReadOnly Property Z As Double
	Get
Visual C++
public:
property double Z {
	double get ();
}
See Also
XYZ Class
Autodesk.Revit.DB Namespace